// Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла for создайте строку '-1-2-3-4-5-6-7-8-9-'
// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
// let str = ' -';
// for (let i = 0; i < arr.length; i++) {
//     str += arr[i] + '-' ;
// }
// console.log(str);

// Дано число n=1000. Делите его на 2 столько раз, пока результат деления не станет меньше 50. Какое число получится?
//     Посчитайте количество итераций, необходимых для этого (итерация - это проход цикла), и запишите его в переменную num.

// let n = 1000;
// let num = 0;
// while (n > 50) {
//     n = n / 2;
//     console.log(n);
//     num++;
// }
// console.log(num);
