/*
 var num = prompt(); //виводимо вікно, те число яке ми вводимо присвоюється num
 console.log(num % 3);//виводимо в consol значення (num % 3)
 if (num % 3 == 0) { //залишок дорівнює нулю?
 console.log("кратно 3");// якщо дорівнює нулю виводить в консоль кратно 3
 } else {//в іншому випадку
 console.log("не кратно"); // якщо не дорівнює (!=) нулю виводить в консоль не кратно
 }*/


/*var num = prompt();
console.log(num % 8);
if (num % 8 ==0) {
    console.log("ok");
}else{
    console.log("ne ok");
}*/

/*var num = prompt(); //виводимо вікно, те число яке ми виводимо присвоюється num
console.log(num % 3);// виводимо в консоль значення (num % 3)
if (num % 3 == 0) { //залишок дорівнює нулю?
    console.log("кратно");// якщо дорівнює нулю виводить в консоль кратно трьом
} else {// в іншому випадку
    console.log("не кратно");// якщо не дорівнює (!=) нулю виводить в консоль не кратно
}*/



/*var num = prompt(); //виводимо вікно, те число яке ми виводимо присвоюється num
    console.log(num % 3); //виводимо в консоль значення (num % 3)
if (num % 3 ==0)// залишок дорівнює нулю?
    console.log(кратно);{ // якщо дорівнює нулю виводить в консоль кратно трьом
} else{ // в іншому випадку
    console.log(не кратно);// якщо не дорівнює (!=) нулю виводить в консоль не кратно
}*/


/*var num = prompt(); //виводимо вікно, те число яке ми виводимо присвоюється num
    console.log(num % 3); // виводимо консоль значення (num % 3)
if (num % 3 == 0){ // залишок дорівнює (==) нулю?
    console.log("кратно");//якщо дорівнює нулю виводить в консоль кратно трьом
}else{ // в іншому випадку
        console.log("не кратно"); //якщо не дорівнює(!=) нулю виводить в консоль не кратно
}*/



/*var num = prompt(); // виводимо вікно, те число яке ми виводимо присвоюється num
console.log(num % 3); // виводимо в консоль значення (num % 3)
if(num % 3 == 0){ // залишок дорівнює (==) нулю?
console.log("кратно 3"); // якщо дорівнює нулю виводить в консоль кратно 3
  } else { //в іншому випадку
console.log("не кратно"); //якщо не дорівнює нулю виводить в консоль не кратно
 }*/


/*var num = prompt(); //виводимо вікно, те число яке ми виводимо присвоюється num
console.log(num % 3); //виводимо в консоль значення
if (num % 3 == 0){ //залишок дорівнює нулю?
console.log("кратно 3"); // якщо дорівнює нулю виводить в консоль кратно трьом
} else{// в іншому випадку
   console.log("не кратно"); //якщо не дорівнює нулю в консоль виводить не кратно
}*/


/*var num = prompt(); // виводимо вікно, те число яке ми виводимо присвоюється num
console.log(num % 3);// виводимо в консоль значення (num % 3)
if(num % 3 == 0){//залишок дорівнює нулю
    console.log("кратно 3"); // якщо дорівнює нулю виводить в консоль "кратно трьом"
} else {// в іншому випадку
    console.log("не кратно"); //якщо не дорівнює нулю виводить в консоль "не кратно"
}*/


/*var i = prompt(); // виводимо вікно, те число яке ми виводимо присвоюється i
console.log(i % 3);// виводимо в консоль значення (i % 3)
if(i % 3 == 0){//залишок дорівнює нулю?
    console.log("кратно 3");// якщо дорівнює нулю виводить в консоль "кратно трьом"
} else {// в іншому випадку
    console.log("не кратно");// якщо не дорівнює нулю виводить в консоль "не кратно"
}*/

/*var d = prompt();//виводить вікно, те число яке ми виводимо присвоюється d
console.log(d % 3);//вводимо в консоль значення (d % 3)
if(d % 3 == 0){//залишок дорівнює нулю?
    console.log("кратно 3");// якщо дорівнює нулю виводить в консоль "кратно 3"
} else {//в іншому випадку
    console.log("не кратно");// якщо не дорівнює нулю виводить в консоль "не кратно"
}*/

/*var s = prompt();// виводить вікно, те число яке ми виводимо присвоюється s
console.log(s % 3);//вводимо в консоль значення (s % 3)
if(s % 3 ==0){//залишок дорівнює нулю?
    console.log("кратно 3");//якщо дорівнює нулю виводить в консоль "кратно 3"
} else{// в іншому випадку
    console.log("не кратно");// якщо не дорівнює нулю виводить в консоль "не кратно"
}*/


/*var x = prompt();// виводить вікно, те число яке ми вводимо присвоюється x
console.log(x % 3);// виводимо в консоль значення (x % 3)
if(x % 3 ==0){//залишок дорівнює нулю?
    console.log("кратно 3");// якщо залишок дорівнює нулю виводить в консоль "кратно 3"
} else{
    console.log("не кратно");//якщо залишок не дорівнює нулю виводить в консоль "не кратно"
}*/

/*var num = prompt();// виводить вікно, те число яке ми вводимо присвоюється num
console.log(num %3);// виводимо в консоль значення (num % 3)
if(num % 3 == 0){//залишок дорівнює нулю?
    console.log("кратно 3");// якщо залишок дорівнює нулю виводить в консоль "кратно 3"
} else {
    console.log("не кратно");// якщо залишок не дорівнює нулю виводить в консоль "не кратно"
}*/

/*var num = prompt(); //виводить вікно, те число яке ми вводимо присвоюється num
console.log(num %3);// виводимо в консоль значення (num %3)
if(num % 3 ==0){//залишок дорівнює нулю?
    console.log("кратно 3"); //якщо залишок не дорівнює нулю виводиться в консоль "кратно 3"
}else {// в іншому випадку
    console.log("не кратно");// якщо залишок не дорівнює нулю виводиться в консоль "не кратно"
}*/

/*var num = prompt(); // виводить вікно те число яке ми вводимо присвоюється num
console.log(num%4);// виводимо в консоль значення (num%4}
if(num%4 == 0){ //залишок дорівнює нулю?
    console.log("ok"); // якщо залишок дорівнює нулю в иводить вконсоль "ок"
}else {// в іншому випадку
    console.log("false");
}*/

/*var num = prompt();// виводить вікно, течисло яке ми вводимо просвоюється num
console.log(num % 5);// виводимо в консоль значення num % 5
if(num % 5 == 0) { //залишок дорівнює нулю?
    console.log("ok");
}else{
    console.log("bred");
}*/

/*var a = prompt();
console.log(a % 7);
if(a % 7 == 0) {
    console.log('ok');
} else{
    console.log('not ok');
}*/



/*var f = prompt();
console.log(f % 5);
if(f % 5 == 4){
    console.log("super");
}else{
    console.log("huinya");
}*/

/*var s = prompt();
console.log(s % 7);
if(s % 7 == 0){
    console.log('ok');
}else{
    console.log('not ok');
}*/






















